micropython/micropython/cc3200/mods/pybtimer.c
/// \method time([value])
/// get or set the value of the timer channel in microseconds
STATIC mp_obj_t pyb_timer_channel_time(mp_uint_t n_args, const mp_obj_t *args) {
    pyb_timer_channel_obj_t *ch = args[0];
    uint32_t value;
    // calculate the period, the prescaler and the match value
    uint32_t period;
    uint32_t match;
    (void)compute_prescaler_period_and_match_value(ch, &period, &match);
    if (n_args == 1) {
        // get
        value = (ch->channel == TIMER_B) ? HWREG(ch->timer->timer + TIMER_O_TBV) : HWREG(ch->timer->timer + TIMER_O_TAV);
        // return the current timer value in microseconds
        // substract value to period since we are always operating in count-down mode
        uint32_t time_t = (1000 * (period - value)) / period;
        return mp_obj_new_int((time_t * 1000) / ch->frequency);
    }
    else {
        // set
        value = (mp_obj_get_int(args[1]) * ((ch->frequency * period) / 1000)) / 1000;
        if ((value > 0xFFFF) && (ch->timer->config & TIMER_CFG_SPLIT_PAIR)) {
            // this exceeds the maximum value of a 16-bit timer
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, mpexception_value_invalid_arguments));
        }
        // write period minus value since we are always operating in count-down mode
        TimerValueSet (ch->timer->timer, ch->channel, (period - value));
        return mp_const_none;
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(pyb_timer_channel_time_obj, 1, 2, pyb_timer_channel_time);

/// \method event_count()
/// get the number of events triggered by the configured edge
STATIC mp_obj_t pyb_timer_channel_event_count(mp_obj_t self_in) {
    pyb_timer_channel_obj_t *ch = self_in;
    return mp_obj_new_int(MAP_TimerValueGet(ch->timer->timer, ch->channel == (TIMER_A | TIMER_B) ? TIMER_A : ch->channel));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pyb_timer_channel_event_count_obj, pyb_timer_channel_event_count);

/// \method event_time()
/// get the time at which the last event was triggered
STATIC mp_obj_t pyb_timer_channel_event_time(mp_obj_t self_in) {
    pyb_timer_channel_obj_t *ch = self_in;
    // calculate the period, the prescaler and the match value
    uint32_t period;
    uint32_t match;
    (void)compute_prescaler_period_and_match_value(ch, &period, &match);
    uint32_t value = MAP_TimerValueGet(ch->timer->timer, ch->channel == (TIMER_A | TIMER_B) ? TIMER_A : ch->channel);
    // substract value to period since we are always operating in count-down mode
    uint32_t time_t = (1000 * (period - value)) / period;
    return mp_obj_new_int((time_t * 1000) / ch->frequency);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pyb_timer_channel_event_time_obj, pyb_timer_channel_event_time);

/// \method duty_cycle()
/// get or set the duty cycle when in PWM mode
STATIC mp_obj_t pyb_timer_channel_duty_cycle(mp_uint_t n_args, const mp_obj_t *args) {
    pyb_timer_channel_obj_t *ch = args[0];
    if (n_args == 1) {
        // get
        return mp_obj_new_int(ch->duty_cycle);
    }
    else {
        // duty cycle must be converted from percentage to ticks
        // calculate the period, the prescaler and the match value
        uint32_t period;
        uint32_t match;
        ch->duty_cycle = MIN(100, MAX(0, mp_obj_get_int(args[1])));
        compute_prescaler_period_and_match_value(ch, &period, &match);
        if (n_args == 3) {
            // set the new polarity if requested
            ch->polarity = mp_obj_get_int(args[2]);
            MAP_TimerControlLevel(ch->timer->timer, ch->channel, (ch->polarity == PYBTIMER_POLARITY_NEG) ? true : false);
        }
        MAP_TimerMatchSet(ch->timer->timer, ch->channel, match);
        return mp_const_none;
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(pyb_timer_channel_duty_cycle_obj, 1, 3, pyb_timer_channel_duty_cycle);

/// \method callback(handler, value, priority)
/// create a callback object associated with the timer channel
STATIC mp_obj_t pyb_timer_channel_callback (mp_uint_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    mp_arg_val_t args[mpcallback_INIT_NUM_ARGS];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, mpcallback_INIT_NUM_ARGS, mpcallback_init_args, args);

    pyb_timer_channel_obj_t *ch = pos_args[0];
    mp_obj_t _callback = mpcallback_find(ch);
    if (kw_args->used > 0 || !_callback) {
        // convert the priority to the correct value
        uint priority = mpcallback_translate_priority (args[2].u_int);

        // validate the power mode
        uint pwrmode = args[4].u_int;
        if (pwrmode != PYB_PWR_MODE_ACTIVE) {
            goto invalid_args;
        }

        // disable the callback first
        pyb_timer_channel_callback_disable(ch);

        uint32_t _config = (ch->channel == TIMER_B) ? ((ch->timer->config & TIMER_B) >> 8) : (ch->timer->config & TIMER_A);
        uint8_t shift = (ch->channel == TIMER_B) ? 8 : 0;
        switch (_config) {
        case TIMER_CFG_A_ONE_SHOT:
        case TIMER_CFG_A_PERIODIC:
            ch->timer->intflags |= TIMER_TIMA_TIMEOUT << shift;
            break;
        case TIMER_CFG_A_CAP_COUNT:
            ch->timer->intflags |= TIMER_CAPA_MATCH << shift;
            break;
        case TIMER_CFG_A_CAP_TIME:
            ch->timer->intflags |= TIMER_CAPA_EVENT << shift;
            break;
        case TIMER_CFG_A_PWM:
            // special case for the match interrupt
            ch->timer->intflags |= ((ch->channel & TIMER_A) == TIMER_A) ? TIMER_TIMA_MATCH : TIMER_TIMB_MATCH;
            break;
        default:
            break;
        }
        if (ch->channel == (TIMER_A | TIMER_B)) {
            // again a special case for the pwm match interrupt
            if (_config == TIMER_CFG_A_PWM) {
                ch->timer->intflags |= TIMER_TIMB_MATCH;
            } else {
                ch->timer->intflags |= (ch->timer->intflags << 8);
            }
        }

        void (*pfnHandler)(void);
        uint32_t intregister;
        switch (ch->timer->timer) {
        case TIMERA0_BASE:
            if (ch->channel == TIMER_B) {
                pfnHandler = &TIMER0BIntHandler;
                intregister = INT_TIMERA0B;
            } else {
                pfnHandler = &TIMER0AIntHandler;
                intregister = INT_TIMERA0A;
            }
            break;
        case TIMERA1_BASE:
            if (ch->channel == TIMER_B) {
                pfnHandler = &TIMER1BIntHandler;
                intregister = INT_TIMERA1B;
            } else {
                pfnHandler = &TIMER1AIntHandler;
                intregister = INT_TIMERA1A;
            }
            break;
        case TIMERA2_BASE:
            if (ch->channel == TIMER_B) {
                pfnHandler = &TIMER2BIntHandler;
                intregister = INT_TIMERA2B;
            } else {
                pfnHandler = &TIMER2AIntHandler;
                intregister = INT_TIMERA2A;
            }
            break;
        default:
            if (ch->channel == TIMER_B) {
                pfnHandler = &TIMER3BIntHandler;
                intregister = INT_TIMERA3B;
            } else {
                pfnHandler = &TIMER3AIntHandler;
                intregister = INT_TIMERA3A;
            }
            break;
        }

        // register the interrupt and configure the priority
        MAP_IntPrioritySet(intregister, priority);
        MAP_TimerIntRegister(ch->timer->timer, ch->channel, pfnHandler);

